In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from datetime import datetime
%matplotlib inline

In [34]:
# df = pd.DataFrame([['2017-05-25',1, np.nan, np.nan],['2017-05-25',3,2,np.nan],['2017-05-25',np.nan,3,3],['2017-05-26',np.nan,np.nan,np.nan],['2017-05-26',np.nan,1,0],['2017-05-26',2,np.nan,-1]], columns = ['time','a','b','c'])
df = pd.DataFrame([['2017-05-25',[1,1,1,1], None, np.nan],['2017-05-25',[None,None,None,None],'96.7',[2,2]],['2017-05-25',np.nan,'3',None],['2017-05-26',np.nan,np.nan,np.nan],['2017-05-26',np.nan,1,0],['2017-05-26',2,np.nan,-1]], columns = ['time','a','b','c'])
df

         time                         a     b       c
0  2017-05-25              [1, 1, 1, 1]  None     NaN
1  2017-05-25  [None, None, None, None]  96.7  [2, 2]
2  2017-05-25                       NaN     3    None
3  2017-05-26                       NaN   NaN     NaN
4  2017-05-26                       NaN     1       0
5  2017-05-26                         2   NaN      -1

In [35]:
group_df = df.groupby("time", as_index=False)
group_df.first()

         time             a    b       c
0  2017-05-25  [1, 1, 1, 1]  NaN  [2, 2]
1  2017-05-26             2  1.0       0

In [26]:
group_df.last()

         time    a    b    c
0  2017-05-25  3.0  3.0  3.0
1  2017-05-26  2.0  1.0 -1.0

In [27]:
group_df.first().combine_first(group_df.last())

         time    a    b    c
0  2017-05-25  1.0  2.0  3.0
1  2017-05-26  2.0  1.0  0.0